app/Controllers/Admin.php

            ->getResult();

        // 🔹 STAFF LIST (FOR DROPDOWN)
        $staffs = (new UserModel())
            ->where('role', 'staff')
            ->where('status', 'active')
            ->orderBy('name', 'ASC')
            ->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'staff'
AND `status` = 'active'
ORDER BY `name` ASC

    public function updateStatus()
    {
        $id = $this->request->getPost('id');
        $status = $this->request->getPost('status');

        $model = new JobApplicationModel();
        $app = $model->find($id);
---
SELECT *
FROM `job_applications`
WHERE `job_applications`.`id` = '32'

        /* ========================================= */

        // ✅ Update status
        $model->update($id, [
            'application_status' => $status
        ]);

        db_connect()->table('application_status_logs')->insert([
            'application_id' => $id,
            'old_status' => $app['application_status'],
            'new_status' => $status,
            'changed_by' => session('user_id'),
            'changed_by_role' => session('role')
        ]);
---
UPDATE `job_applications` SET `application_status` = 'rejected'
WHERE `job_applications`.`id` IN ('32')
INSERT INTO `application_status_logs` (`application_id`, `old_status`, `new_status`, `changed_by`, `changed_by_role`) VALUES ('32', 'selected', 'rejected', '4', 'admin')

    public function statusHistory($id)
    {
        $rows = db_connect()
            ->table('application_status_logs l')
            ->select('l.old_status, l.new_status, u.name, l.changed_by_role as role, l.created_at')
            ->join('users u', 'u.id = l.changed_by')
            ->where('l.application_id', $id)
            ->orderBy('l.created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `l`.`old_status`, `l`.`new_status`, `u`.`name`, `l`.`changed_by_role` as `role`, `l`.`created_at`
FROM `application_status_logs` `l`
JOIN `users` `u` ON `u`.`id` = `l`.`changed_by`
WHERE `l`.`application_id` = '32'
ORDER BY `l`.`created_at` DESC