app/Controllers/Admin.php

    public function updateStatus()
    {
        $id = $this->request->getPost('id');
        $status = $this->request->getPost('status');

        $model = new JobApplicationModel();
        $app = $model->find($id);

        if (!$app) {
            return $this->response->setJSON([
                'success' => false,
                'csrf' => csrf_hash()
            ]);
        }

        $model->update($id, [
            'application_status' => $status
        ]);
---
SELECT *
FROM `job_applications`
WHERE `job_applications`.`id` = '20'
UPDATE `job_applications` SET `application_status` = 'under_review'
WHERE `job_applications`.`id` IN ('20')

    public function candidateDetails($id)
    {
        $appModel = new JobApplicationModel();
        $skillModel = new CandidateSkillModel();
        $eduModel = new AcademicQualificationModel();

        // 🔹 Get application + role
        $app = $appModel
            ->select('job_applications.*, roles.role_name')
            ->join('roles', 'roles.id = job_applications.role_id', 'left')
            ->where('job_applications.id', $id)
            ->first();

        if (!$app) {
            return $this->response->setJSON(['error' => 'Not found']);
        }

        return $this->response->setJSON([
            'role' => $app['role_name'], // ✅ APPLIED ROLE
            'skills' => $skillModel->where('application_id', $id)->findAll(),
            'edu' => $eduModel->where('application_id', $id)->findAll()
---
SELECT *
FROM `candidate_skills`
WHERE `application_id` = '32'
SELECT *
FROM `academic_qualifications`
WHERE `application_id` = '32'

    public function roles()
    {
        $roles = (new RoleModel())->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `roles`
ORDER BY `created_at` DESC