app/Controllers/Auth.php

    public function authenticate()
    {
        $email = strtolower(trim($this->request->getPost('email')));
        $password = $this->request->getPost('password');

        $user = (new UserModel())
            ->where('email', $email)
            ->where('status', 'active')
            ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'r.mahesh2903@gmail.com'
AND `status` = 'active'
 LIMIT 1