app/Controllers/Staff.php

    public function index()
    {
        $staffs = (new UserModel())
            ->where('role', 'staff')
            ->orderBy('created_at', 'DESC')
            ->findAll();
---
SELECT *
FROM `users`
WHERE `role` = 'staff'
ORDER BY `created_at` DESC

    public function block($id)
    {
        (new UserModel())
            ->where('id', $id)
            ->where('role', 'staff')
            ->set(['status' => 'blocked'])
            ->update();
---
UPDATE `users` SET `status` = 'blocked'
WHERE `id` = '22'
AND `role` = 'staff'

    public function UnBlock($id)
    {
        (new UserModel())
            ->where('id', $id)
            ->where('role', 'staff')
            ->set(['status' => 'active'])
            ->update();
---
UPDATE `users` SET `status` = 'active'
WHERE `id` = '22'
AND `role` = 'staff'