app/Controllers/StaffDashboard.php

    public function index()
    {
        $staffId = session('user_id');

        $apps = (new JobApplicationModel())
            ->select('job_applications.*, u.name AS assigned_by')
            ->join(
                'application_staff_assignments a',
                'a.application_id = job_applications.id'
            )
            ->join(
                'users u',
                'u.id = a.assigned_by',
                'left'
            )
            ->where('a.staff_id', $staffId)
            ->orderBy('a.assigned_at', 'DESC')
            ->findAll();
---
SELECT `job_applications`.*, `u`.`name` AS `assigned_by`
FROM `job_applications`
JOIN `application_staff_assignments` `a` ON `a`.`application_id` = `job_applications`.`id`
LEFT JOIN `users` `u` ON `u`.`id` = `a`.`assigned_by`
WHERE `a`.`staff_id` = '23'
ORDER BY `a`.`assigned_at` DESC