app/Models/RoleModel.php

SELECT *
FROM `roles`
WHERE `status` = 'active'
ORDER BY `role_name` ASC
---
    public function getActiveRoles()
    {
        return $this->where('status', 'active')
                    ->orderBy('role_name', 'ASC')
                    ->findAll();